Revit 2027 API
BeforeExecutedEventArgs Class
 The event arguments used by AddInCommandBinding's BeforeExecuted event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitEventArgs
 Autodesk.Revit.UI.Events.CommandEventArgs
 Autodesk.Revit.UI.Events.BeforeExecutedEventArgs
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class BeforeExecutedEventArgs : CommandEventArgs
Public Class BeforeExecutedEventArgs
	Inherits CommandEventArgs
public ref class BeforeExecutedEventArgs : public CommandEventArgs
type BeforeExecutedEventArgs =
    class
        inherit CommandEventArgs
    end
The BeforeExecutedEventArgs type exposes the following members.
Properties
Name | Description
ActiveDocument |  The active document.
(Inherited from CommandEventArgs)
Cancel |  Indicates whether the event is being cancelled. When the event is cancellable, set the property to True to cancel it.
(Inherited from RevitEventArgs)
Cancellable |  Indicates whether an event may be cancelled by an event delegate.
(Inherited from RevitEventArgs)
CommandId |  The command id.
(Inherited from CommandEventArgs)
UsingCommandData |  Indicates whether or not the Revit journal will include custom data populated by the application associated with this command.
Top
Methods
Name | Description
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
 This event is cancellable. If your callback sets the Cancel property to true, the command will not execute.
See Also
Reference
Autodesk.Revit.UI.Events Namespace